[
  {
    "date": "May 27th, 2025",
    "cat3": "Web Dev Affairs",
    "post": "At first glance, I acquiesced to the notion that developer jobs, along with many others, are headed for the garbage can, thanks to A.I. As a Java Engineer, my opinion could not be further from that notion. Here's why: First, and foremost, General Audience, i.e., production-worthy, product releases depend on absolute reliability, without room for a sliver of hallucination in functionality. Augmenting productivity, e.g., transforming a junior developer into a 10X Developer with the aid of A.I., is the nuanced viewpoint. The wholesale replacement of a 129 I.Q. college grad--skilled in automation, math and computer science--with a chatbot is the simplistic, know-nothing journalism viewpoint. Now, I assert that all things being equal, the increase in new job demand is not obvious because future definitions have no merit until they are applied. For example, The entry-level job may transition from being a data gatherer to being a data checker, ensuring the AI didn’t miss anything or digging deeper into nuggets uncovered. 1 The problem with enterprise-grade production-level software engineering challeges lies in the details and the edge cases--edge cases that humans recognize and solve in our own lives.",
    "blogcite": "1. https://www.cio.com/article/3511493/microsoft-makes-quantum-breakthrough-plans-commercial-offering.html",
    "id": "41981e64-e920-4889-a96e-18558755cd2a",
    "author": "by Thomas Maestas, MA",
    "title": "A.I. Noise Pollution",
    "did": "25-05-27"
  },
  {
    "date": "January 3, 2025",
    "cat3": "A.I.Now.",
    "post": "There is a scene in the second Terminator movie in which the protagonist, John Connor, remarks, \"Hasta la Vista Baby\" as he fires a single bullet from his pistol against the nitro-glycerin soaked robot from the future, and soon shattered bot. Needless to say, the future hadn't accounted for the basic physics regarding this point-of-pain, which ultimately leads to the triumph of humanity. And thus, so are we at the crossroads -- quite a distance between 1984 and 2025. I bring up this Hollywood scene in reference to Sam Altman's latest pronouncements about ASI, i.e., Artificial Super Intelligence. Let's not get of ourselves, Sam. Artificial, yes, Super, no, Intelligence, yes, albeit mildly. Sadly, though, one rain-soaked night of a drip or yet one lonely star-speckled night with one sun pulse renders the singular silver bullet that Hollywood shall not need to invent to provide a fantastic storyline. ;-)",
    "blogcite": "https://indianexpress.com/article/technology/artificial-intelligence/sam-altman-on-artificial-superintelligence-there-is-a-lot-of-compounding-left-to-do-9661302/",
    "id": "870afd09-f2dc-47d0-91d6-ef5ebd0e4929",
    "author": "by Thomas Maestas, MA",
    "title": "Hasta la Vista, Baby",
    "did": "25-01-03"
  },
  {
    "date": "September 21, 2024",
    "cat3": "Sociology Tomorrow!",
    "post": "Epistemology, the science of truth, or the fancy word for factually asking why and how events occur and unwind. Technology's role in this subject evokes the question of today's casual relationship with Truth, exemplified by the \"truth\"-according-to-me approach to interacting with the world. This legacy article's critique of Martin Gurri's 2014 The Revolt of the Public encapsulates Gurri's central themes for the second Guttenberg phenomenon, and the consequences of providing until-then-unassailable-information freely to the general public. In the present case, internet-sourced informational apps provide enough information to supplant faith in traditional media--i.e., the proverbial Fourth Estate. That’s what a “crisis of authority” looks like in the real world. And it’s crucial to distinguish this crisis from what’s often called the “epistemic crisis” or the “post-truth” problem. If Gurri’s right, the issue isn’t just that truth suddenly became less important; it’s that people stopped believing in the institutions charged with communicating the truth. ...and what goes up, must come down ... As the internet gave rise to an explosion of information, there was a concurrent spike in political instability. The reason, he surmised, was that governments lost their monopoly on information and with it their ability to control the public conversation. So the question must be asked: Is the media still the 4th Estate that adds balance to civic engagement? or rather, has its role turned to a Fifth Column with its own agenda. And, if this is the case, does the splintering of news sources improve matters?",
    "blogcite": "1. www.vox.com/future-perfect/22301496/martin-gurri-the-revolt-of-the-public-global-democracy 1. https://www.amazon.com/Revolt-Public-Crisis-Authority-Millennium/dp/1732265143",
    "id": "efeb06b9-ff53-4477-b496-4c144195b08e",
    "author": "by Thomas Maestas, MA",
    "title": "Truth, Post-Truth, and the Truth According to Me",
    "did": "24-09-21"
  },
  {
    "date": "September 20, 2024",
    "cat3": "Quantum Data",
    "post": "Finally, a Few More Seconds of Calculation and 800x Reliability improvement by means of the bread-and-butter of software engineering: logical virtualization: In April, Microsoft and Quantinuum demonstrated logical qubits with an error rate 800 times better than physical qubits. On Tuesday, Zander said the partners had applied their improved qubit virtualization system to create and entangle 12 highly reliable logical qubits on Quantinuum’s 56-physical-qubits H2 machine. And for further context ... A logical qubit, as opposed to a physical qubit, is a higher-level abstraction used in fault-tolerant quantum computing to protect against noise and errors. The main issue with today’s Noisy Intermediate-Scale Quantum (NISQ) machines is that the physical qubits are too noisy and error-prone, making the machines impractical for real-world applications, Zander said. That’s why we must transition to using reliable logical qubits that combine multiple physical qubits together to protect against noise and to maintain coherence for long-running computations.",
    "blogcite": "1. https://www.cio.com/article/3511493/microsoft-makes-quantum-breakthrough-plans-commercial-offering.html",
    "id": "ce6f8fae-bfbe-4e87-9f52-ae16713e6edf",
    "author": "by Thomas Maestas, MA",
    "title": "Noise Pollution",
    "did": "24-09-20"
  },
  {
    "date": "August 7, 2024",
    "cat3": "Web Dev Affairs",
    "post": "In my last post, all was revealed with regard to the mechanics of failure surrounding the July 19th CloudStrike disaster, which effectuated perturbations to the entire global community, save for those not inextricably tied to technology To briefly recap in a nutshell, Microsoft began to allow 3rd party vendors, like CloudStrike, to use dynamic definition files to update the driver that talks to the kernel, not just in properties (which is dangerous enough), but in programmable driver code , so that the driver is running differently than when it was originally certified by Microsoft's Windows Hardware Quality Labs (WHQL) 1 . Therefore, the worst possible scenario plays out in Kernel mode -- Unsigned code, of unknown provenance, running untrusted P-Code--again, programming code embedded waithin configuration files, unapproved by Windows Hardware Quality Labs. I think we are all left aghast, scratching our heads. It is what it is, so why do I bring up the subject again? Why raise up the spectre? I feel there are invaluable lessons to be drawn from the incident, so let us take an even closer look at the train-wreck in slow motion, in all its minutiae. What exactly occurred within the anti-virus program that went wrong? To find out, let us look at the publicly accessible crash dump information, found on every Windows machine; alas, the offending instruction from the logs: |LINE 1| fffff802 |LINE 2| 1df335a1 458b08 mov r9d,dword ptr [r8] ds:002b:000000`0000009c=???? |LINE 3| Resetting default scope |LINE 4| BLACKBOXBSD: 1 (!blackboxbsd) |LINE 5| BLACKBOXNTFS: 1 (!blackboxntfs) |LINE 6| BLACKBOXPNP: 1 (!blackboxpnp) |LINE 7| BLACKBOXWINLOGON: 1 So, without belabouring the point, line 2 reveals an attempt to move data to register 9 from a memory pointer in register 8. Pointer 8 is unintelligable, i.e. it is not a integer, but something else, which then attempts the next in line 9c , which then dereferences, and causes a null pointer exception . Of course, a testing team, even a lone tester in a lonely office cubicle, would have caught this simple error, however CrowdStrike did not have that, nor yet did it have a test against null-pointer protection (CloudStrike takes full blame here) nor parameter validation into a kernel function (Windows shares in the blame here). The list of woes begins to pile up from here, implicating teams upon teams and different levels of management on both Windows and CloudStrike sides, so the point is moot. Further details are moot, but is there really a broader lesson to be learned here? You get what you pay for! To be sure, it is only in retrospect that these lines carry global importance, but when ownership & management are both intent on cutting corners, such safeguards and so-called petty details no longer matter. So, when cost-saving and unrealistic expectations hit the hard facts on the ground --not a reference to the software glitches in the Boeing 737--but to the actual consequences in terms of body count (exceeding 1,000 souls, I believe), the consequences are deadly realistic, and final. Yet there was no such finality with this particular blue-screen glitch; most have moved on and most already forgot all about the CloudStrike disaster ... Are these lessons lost forever? It appears so, and even the once-immortal ghost in the shell is eviscerated from the collective memory of the global community, in spite of the daily spite emanating from Our Daily Tech dot Net!",
    "blogcite": "1. learn.microsoft.com/en-us/windows-hardware/drivers/install/whql-release-signature",
    "id": "eae571af-f14b-4e93-ad2f-5cff98fde506",
    "author": "by Thomas Maestas, MA",
    "title": "Haunted by the Ghosts of the Past, Part II",
    "did": "24-08-07"
  },
  {
    "date": "August 6, 2024",
    "cat3": "Web Dev Affairs",
    "post": "The Ghosts of the Past have come again to steer my thoughts. Hélas! I cannot but acquiesce to them. After all, it was a dreary night, about a month ago, in the immediate aftermath--whether canceled flights or muted news stations--of the infamous CloudStrike bug that the misdirected accusations and misplaced assumptions abounded across the land. It was the voice of my ex-girlfriend, with whom I debated, that resoundedly defended Windows, because after all, CloudStrike (CS) isn't a dependency , a simple software. Blame it on the team, she said, blame it on the decision to install the software.. blame it on Delta. They should have chosen a better anti-virus like McAfee! To this notion I inserted my 2 cents that it was indeed a dependency of Windows. So it was both the fault of CS and how much more of Microsoft for allowing it. Further, the users of Windows servers were powerless to prevent the error. To resolve this enigmatic question, the reader and I must dive deep: What really is the difference between the stomach-curling Blue Screen and Linux's black screen of death, or rarer yet, Mac's Pink Screen of demise? Nothing, it just so happens the former happens. And happens alot more frequently. But why you ask? Because of the irascible and increasingly unscrupulous bi-modal architecture of Windows itself. My story cannot complete itself without touching upon these details --that the strict line between kernel-mode (i.e. external apps, users, etc are forbidden, being relegated to user-mode.) So what takes place in kernel mode? Well those delicate activities and configurations that only Windows will certify with ample testing, like the thread scheduler (bear with this tangent, dear reader), heap manager, and perhaps a graphical functionality, for example, to access driver, which would talk to the GPU across the PCI Bus. So, where does CloudStrike's FALCON fit into this picture? [Returning now to the point of whether or not this antimalware software Falcon is a dependency]. Earlier antimalware not only looks at files, but also the behavior of the operating itself; hence the need access the kernel ... thus passing beyond the line of kernel mode -- a necessary evil you say? yes, a necessary risk. However, it used to be that modifcations of the this device driver (i.e. not hardware, just CloudStrike's Falcon software; any software alterations MUST therefore pass any tests, proffered by Windows Hardware Quality Labs (WHQL), which at the end of such battery of tests, is signed & certified by Windows. ) Thus, the necessary evil-risk is indeed mitigated; and all remain happy, without any case of the blues. Sadly, though, times change and standards stoop ever lower -- because it is 2024, and the once-lofty WHQL no longer requires alterations to such drivers as Falcon to pass the battery of tests because of the advent of now-programmable \"dynamic definition files\" (which now re-program the behavior of the driver itself! ...thereby circumventing the once-strict line of defense that guarded the sacred Kernel Mode from harm. And so, my short tangent is completed, now that we know that this dangerous software can enter and exit kernel mode access at will -- The case STILL justifies Windows and CloudStrike because the User/Enterprise is still at fault for using this so-called non-dependency, correct? Wrong. Windows has allowed CloudStrike (in a bid to embed its software into the OS) to mark their driver as a \"Boot-Start Driver\"--id est, a driver for a device that must be installed to start the MS Windows Operating System. Huh?!? Yep. Whereas most boot-start drivers are included in driver packages that are \"in-the-box\" with Windows, Windows automatically installs these boot-start drivers during first boot of the system. If a boot-start driver for a device is not included in a driver package that is \"in-the-box\" with Windows, a user can install an additional vendor-supplied driver package for the device; And in these instances, let's say on a Saturday afternoon when cleaning out the home computer, refreshing, and reinstalling software, these driver packages should be added to the image offline before the image is deployed to a system. Simple. And Safe. Right? Wrong. CrowdStrike did not want you booting Windows without their precious software! So instead you must reboot Windows in Safe Mode, to remove or uninstall this surreptitious piece of software. And so, there you have it, in 1,000 words or less, this Spectre of the Past has been exposed, and the public can now act as Judge and Jury to lay all the blame on both Windows lax security policy and CloudStrike's ineptitude to not even test for null-pointer errors (the absolute simplest errors and simplest to test/protect against), while justifying and restoring innocence to the many clients, user or enterprise alike, who were left powerless to the impending doom that CloudStrike Falcon would shrowd the world--if only for a a weekend. So next time there is a Ghost in the Shell, we can learn to undermine and root out the perils that lay beneath!",
    "blogcite": "",
    "id": "889ee82e-f467-4384-b345-65b6d6454fb1",
    "author": "by Thomas Maestas, MA",
    "title": "Haunted by the Ghosts of the Past",
    "did": "24-08-06"
  },
  {
    "date": "August 1, 2024",
    "cat3": "A.I.Now!",
    "post": "What is the true cost of A.I. Supremacy? . ..experts say that the openness and accuracy of the Llama 3.1 family of models pose an existential threat to providers of closed proprietary large language models. 1 The forces of profiteers have converged upon the (apparent) novelties of A.I. to find a niche from which to extract wealth. Not unlike the dot-com bubble, Virtual/Augmented Reality, quantum-era, and even the short-lived NFT bubbles, the research to demarcate technical boundaries and timelines for sustainable return-on-investment in A.I. remains murky. And yet, 1.5 years since the arrival of ChatGPT 1.0, the one thing is clear: depth-wise development of the tech is banal (unless you count the hot debates between byte-sized versus multi-word tokenization), it is the breadth-wise implementation, security, and enterprise-ready accuracy of the tool into existing technologies that counts. So what about the unfathomable data-training resources necessary for competitive LLM models? With Meta's July open-sourcing of its mega- 400 billion parameterized model, i.e. Llama 3.1, the world is at the fingers of any typical middle-schooler or A.I. hobbyist to create monumental feats. But not-so-fast say you! Okay, it is true that the computing power needed for this model is a mere 700 Watts of power, which rivals small countries. Renting of the item is another cost rounding out at $300,000/year... So who can afford to run this model? And worse yet, will the world become even more dependent on cloud-computing? The time has arrived for developers to fine-tune their apps to quickly access certain problems with a diverse range of LLMs, reserving the big questions for the big models, if only briefly. This architectural pattern, or at least paradigm, already exists -- It was with Quantum technologies that the world was first introduced to short bursts of brilliance (Given that the super-imposed quantum state needed for computation is a matter of seconds still.) So now that we have identified the next big Wall for innovation --electricity and hardware cost--should one fear a downturn in innovation? Ever emphatically, I say no, because after all Necessity is the Mother of Invention!",
    "blogcite": "1. infoworld.com/article/3477234/why-metas-llama-3-1-is-a-boon-for-enterprises-and-a-bane-for-other-llm-vendors.html 1. ai.meta.com/blog/meta-llama-3-1/",
    "id": "ec2c659d-93c6-448b-8a63-056a1ae9f6c5",
    "author": "by Thomas Maestas, MA",
    "title": "Democraticized Technology: On the Growing Costs of A.I. Computing",
    "did": "24-08-01"
  },
  {
    "date": "January 7, 2024",
    "cat3": "A.I.Now!",
    "post": "7 days into 2024, and machine-learning, whether it be the old-fashioned quantitative analysis and propensity matching using the Law of Large Numbers, or the new syntactic Generative Pre-trained Transformer (4) ... Different Use Cases will no doubt spur a retro-active inventory of the various generations of machine-learning branches of knowledge that grew up, thrived, and retired to the dusty confines of Academic Halls. I recall being a Universite of Montreal doctoral student in 2017, which coincided with Facebook's $100 million donation to the UM CS dept...however times were to change: ironically enough, the 2nd Crypto winter struck 2018-2021 ... 1 This period in which neural network models, and nearly all designs, (except for the narrow-scoped domains of AI research, like self-driving) hit their infrastructural limits. After the 3rd or even let's say the 7th or 17th layer of neural networking creates unfathomable calculations -- and hence all the startup investment money died out as researchers in Montreal, Silicon Valley, and Szchenzen (I won't attempt the spelling), and thus interrupting the usual flow of academic-intellectual capital from flowing from academia to consumer products--who can inspire the next generation of Tomb Raiders from digging into those algorithms? --perhaps a couple dozen thousand academic citations later, we'll have recursion-based or graph-based algorithm perhaps, that were labored over for thousands of hours, carefully tailored to the university researchers' whim and intellectual compass. Alas, the spirits of antiquity call out from the marble halls of academia for new investment money because lost treasures await those ready to look into the past, in order to rightly direct the future, especially in terms of A.I.-Human Alignment, which remains the å-propos controversy of the time. needless to say, although the author like CoPilot & ChatGPT for trivial musing, but never to impersonate the words of Thomas Milton, who speaks for his own self",
    "blogcite": "1. https://bdtechtalks.com/2018/11/12/artificial-intelligence-winter-history/",
    "id": "798f97d8-cba2-44b5-91e1-fbf57f4e92e7",
    "author": "by Thomas Maestas, MA",
    "title": "A Soft Look into A.I.'s Past to guide the Hard Turns that lay Ahead",
    "did": "24-01-07"
  },
  {
    "date": "December 30, 2023",
    "cat3": "Web Dev Affairs",
    "post": "Due in March, the next version of standard Java will have 12 features including previews of scoped values, structured concurrency, stream gatherers, and the ability to execute multi-file programs. 1 Doubtless the accelerating pace of Angular and Spring Frameworks, coupled with the syntactic evolutions of Python 2 to 3 upheaval, and the once-per-18 months language versioning of Java and EcmaSript-JavaScript. Why? why must languages and frameworks expand and multiply. The expansion of digital nature of every business arrives because every business, from every sector, and any size, is de facto a tech business. The great philsophers throughout the ages have always argued that civilization and enlightenment are limited in their breadth by the limitations of the philophy's inherent language, i.e., syntax. Thus, the predominant languages of philosophy depended on ever-growing syntax to describe new conceptual phenomena. --And the same rings true with technological code: The once linear expansion of language has been replaced by an exponential expansion of syntax to power the expanding wish-list of 21st business and markets demands. And so at a time of peril for all developers buried beneath ever more and more homework, there has arrived a help from Above the code stack: From language model itsel, the Large Language Model and its derivate syntax-oriented A.I. arrives not moment too soon to break developers free from the growing onslaught of boilerplate code!",
    "blogcite": "1. https://www.infoworld.com/article/3708329/jdk-22-the-new-features-in-java-22.html",
    "id": "3fe2d93e-6702-46ce-a3d6-f508414fdd72",
    "author": "by Thomas Maestas, MA",
    "title": "On the Accelerating Pace of Software BoilerPlate and the Advent of AI",
    "did": "23-12-30"
  },
  {
    "date": "January 1, 2023",
    "cat3": "Web Dev Affairs",
    "post": "Happy New Year's 202 3 4! Oops, I literally just typed 3. Well, it's a new year. different day, different dollar. Due in March, the next version of standard Java will have 12 features including previews of scoped values, structured concurrency, stream gatherers, and the ability to execute multi-file programs. 1 Doubtless the accelerating pace of Angular and Spring Frameworks, coupled with the syntactic evolutions of Python 2 to 3 upheaval, and the once-per-18 months language versioning of Java and EcmaSript-JavaScript. Why? why must languages and frameworks expand and multiply. The expansion of digital nature of every business arrives because every business, from every sector, and any size, is de facto a tech business. The great philsophers throughout the ages have always argued that civilization and enlightenment are limited in their breadth by the limitations of the philophy's inherent language, i.e., syntax. Thus, the predominant languages of philosophy depended on ever-growing syntax to describe new conceptual phenomena. --And the same rings true with technological code: The once linear expansion of language has been replaced by an exponential expansion of syntax to power the expanding wish-list of 21st business and markets demands. And so at a time of peril for all developers buried beneath ever more and more homework, there has arrived a help from Above the code stack: From language model itsel, the Large Language Model and its derivate syntax-oriented A.I. arrives not moment too soon to break developers free from the growing onslaught of boilerplate code!",
    "blogcite": "1. https://www.infoworld.com/article/3708329/jdk-22-the-new-features-in-java-22.html",
    "id": "54421be4-a635-425e-adc6-af8204cd060e",
    "author": "by Thomas Maestas, MA",
    "title": "On the Accelerating Pace of Software BoilerPlate and the Advent of AI",
    "did": "23-12-30"
  },
  {
    "date": "December 30, 2023",
    "cat3": "Web Dev Affairs",
    "post": "Due in March, the next version of standard Java will have 12 features including previews of scoped values, structured concurrency, stream gatherers, and the ability to execute multi-file programs. 1 Doubtless the accelerating pace of Angular and Spring Frameworks, coupled with the syntactic evolutions of Python 2 to 3 upheaval, and the once-per-18 months language versioning of Java and EcmaSript-JavaScript. Why? why must languages and frameworks expand and multiply. The expansion of digital nature of every business arrives because every business, from every sector, and any size, is de facto a tech business. The great philsophers throughout the ages have always argued that civilization and enlightenment are limited in their breadth by the limitations of the philophy's inherent language, i.e., syntax. Thus, the predominant languages of philosophy depended on ever-growing syntax to describe new conceptual phenomena. --And the same rings true with technological code: The once linear expansion of language has been replaced by an exponential expansion of syntax to power the expanding wish-list of 21st business and markets demands. And so at a time of peril for all developers buried beneath ever more and more homework, there has arrived a help from Above the code stack: From language model itsel, the Large Language Model and its derivate syntax-oriented A.I. arrives not moment too soon to break developers free from the growing onslaught of boilerplate code!",
    "blogcite": "1. https://www.infoworld.com/article/3708329/jdk-22-the-new-features-in-java-22.html",
    "id": "20c00d09-f8ec-4ddd-80fc-e3cedf5ddcc6",
    "author": "by Thomas Maestas, MA",
    "title": "On the Accelerating Pace of Software BoilerPlate and the Advent of AI",
    "did": "23-12-30"
  },
  {
    "date": "April 14, 2022",
    "cat3": "Musing Blockchain",
    "post": "The importance of reducing electricity cannot be overstated, most importantly it provides an ecological image boost--but not much more. Ethereum's Merge from Proof-of-work to Proof-of-stake is the big news, however the big liabilities such as gas transactioanal fees and throughput will not improve at all! Layer 2 solutions and side chains create an uncomforatable level of platform dependence. Beiko was questioned by an individual about Ethereum miners who have been securing the network. The individual asked the Ethereum developer if miners would be “left out to dry.” Beiko responded to the person and explained that he would not invest in any mining devices going forward. “I would strongly suggest not investing more in mining equipment at this point,” the Ethereum developer tweeted. Then the individual asked if developers planned the “plug pull” for June or if the ether mining community has more time. Beiko also replied to that question as well and said: It won’t be June, but likely in the few months after. No firm date yet, but we’re definitely in the final chapter of PoW on Ethereum. 1",
    "blogcite": "1. https://news.bitcoin.com/ethereum-dev-says-the-merge-could-be-delayed-a-few-months-strongly-suggests-not-investing-in-eth-mining-rigs/",
    "id": "dd595d55-f7ba-41a3-b409-d9fde5b97f06",
    "author": "by Thomas Maestas, MA",
    "title": "The Big Merge",
    "did": "22-04-14"
  },
  {
    "date": "February 19, 2022",
    "cat3": "Sociology Tomorrow!",
    "post": "Like Starsky & Hutch, detectives in the abstract, symbolic world often work best together in pairs, given Fred Brooks' Maxim that adding minds to a project commensurably delays project completion. This concept illustrates how an intellectual partnership with computers will shape professionalism and the workplace. ... and, scholarly professions benefit from computing symbiosis ... Similarly, computers are becoming increasingly indispensable tools for mathematicians, who use them not just to carry out calculations but to solve otherwise impossible problems and even verify complicated proofs. And as machines become better at solving problems, this year has also seen new progress in understanding just how they got so good at it. 1",
    "blogcite": "1. https://www.quantamagazine.org/the-year-in-math-and-computer-science-20211223/",
    "id": "e00d88e5-20ce-40d5-910c-5e8af1a12365",
    "author": "by Thomas Maestas, MA",
    "title": "A year for Math and Science: Embracing our Bots",
    "did": "22-02-19"
  },
  {
    "date": "February 18, 2022",
    "cat3": "A.I.Now.",
    "post": "Beyond computing power and discussions of \"A.I. Winters\" and processing limitations, one may overlook a more decisive approach to machine learning development, evolving from the what and how, to the why ... however hard it is to extricate Hollywood's depictions of hope and fear from our minds! This 2021 Wired article's prescience on artificial intelligence is worth a read: More recently, techniques of machine learning have been used to gain an understanding from a database of successful proofs to generate more proofs. But although the proofs are new, they do not pass the test of exciting the mathematical mind. It’s the same for powerful algorithms, which can generate convincing short-form text, but are a long way from writing a novel. But in 2021 I think we will see – or at least be close to – an algorithm with the ability to write its first mathematical story. Storytelling through the written word is based on millions of years of human evolution, and it takes a human many years to reach the maturity to write a novel. But mathematics is a much younger evolutionary development. A person immersed in the mathematical world can reach maturity quite quickly, which is why one sees mathematical breakthroughs made by young minds. This is why I think that it won’t take long for an AI to understand the quality of the proofs we love and celebrate, before it too will be writing proofs. Perhaps, given its internal architecture, these may be mathematical theorems about networks – a subject that deserves its place on the shelves of the mathematical libraries we humans have been filling for centuries. 1",
    "blogcite": "1. https://www.wired.co.uk/article/marcus-du-sautoy-maths-proofs",
    "id": "5b148d98-7a05-4b33-8612-8e6a14b17b2d",
    "author": "by Thomas Maestas, MA",
    "title": "I Think Therefore I am",
    "did": "22-02-18"
  },
  {
    "date": "February 17, 2022",
    "cat3": "Sociology Tomorrow!",
    "post": "Taxes ... simultaneously the ultimate bane and archenemy for the Greedy, yet also the easiest way to share; and sharing, whether compulsory or not, feels good. So, by extension, taxes are good. Yet another positive attribute of Tax is the power of attention. There is no brighter light of scrutiny and organization than tax, to de-complicate and elucidate where money is, where it goes, and what it does. On the subject of complicated, changing , obscure financial landscapes ... ... Deeply complicated, dynamic systems like the crypto space can do well with a set of pliable, flexible regulation to further efficiency and faireness for the cryptocurrency system; but most of all, further intuitive clarity for the wider public. Crypto may have started out as a discreet decentralized economy, but now that the nearly $2 trillion sector has gone mainstream enough to occupy coveted Super Bowl ad space, the Internal Revenue Service (IRS) is well clued in. The IRS classifies cryptocurrency as intangible property for tax purposes, which means the profits you make from selling virtual currency are subject to capital gains taxes. This holds true whether you bought bitcoin or altcoins on a crypto exchange like Coinbase, or simply used an app like Venmo or PayPal to buy and use cryptocurrency. However exciting crypto may be, if you gave it as a gift, you should be aware of IRS rules on gifting. There’s a $15,000 gift threshold for 2021, meaning the giver doesn’t have to pay taxes on the gift as long as it's worth $14,999 or less. If the value of the gift is over $15,000, the tax burden falls on the generous donor, who must file IRS form 709. 1",
    "blogcite": "1. https://www.coindesk.com/learn/you-may-owe-crypto-taxes-on-these-surprising-things-in-2022/",
    "id": "960ddb6a-1bfa-4b4a-9c32-64ff9843dbfc",
    "author": "by Thomas Maestas, MA",
    "title": "The Clarity of Money",
    "did": "22-02-17"
  },
  {
    "date": "October 23, 2021",
    "cat3": "Sociology Tomorrow!",
    "post": "As a cyclist, a runner, a pedestrian, and sometimes driver, my earbuds stay in. Whether ordering from my Starbucks Barista or listening to traffic, proximal noise matters! Given the importance of hearing your surroundings crystal-clear while conversing or listening to music is a safety feature extraordinaire. Yet, Apple's 2021 AirPods don't carry this essential feature that any typical $100 earbud surely offers. So, IMHO, the only worthwhile Apple AirPod is the very pricey AirPod Pro. Once you get them seated in your ears, the new AirPods sound OK. But it's annoying how much outside sound gets in when you’re out and about, which makes everything much muddier. Again, in comparison to similarly priced models from Jabra, Samsung, and other top-tier modern producers, these get left in the dust. 1 Whether for safety or enhancement, AirPod Pro is the way to go ...",
    "blogcite": "1. https://www.wired.com/review/apple-airpods-pro/ 2. https://www.wired.com/review/apple-airpods-pro/",
    "id": "c412ba6d-33ab-4a45-b43c-6ab832453728",
    "author": "by Thomas Maestas, MA",
    "title": "Salutations of Safety, and the Wonderous Era of Conxtext-Aware Noise Canceling and Amplification",
    "did": "21-10-23"
  },
  {
    "date": "October 22, 2021",
    "cat3": "Web Dev Affairs",
    "post": "I've always enjoyed the maxim that if you want to get somewhere fast, go it alone. 1 If you want to go far collaborate. I like to to fast. So does Apple. And since the \"End of Moore's Law\" , the only viable solution was multi-core processors. The only heretofore impossible other option requires separate vendors to provide separate, specialized chips ... However, Because Apple manufactures in-house chips, and owns the hardware, System-on-a-Chip can be realized, providing a much better solution to the crisis of the \"End of Moore's Law\". 2",
    "blogcite": "1. Source: Ancient African Proverb 2. https://www.technologyreview.com/2020/02/24/905789/were-not-prepared-for-the-end-of-moores-law/",
    "id": "9dbe6dfa-3c87-48f8-b956-21f630e3bf83",
    "author": "by Thomas Maestas, MA",
    "title": "Shifting Technological Super-Structures, Part V: <br />M1 Chip: The Long-awaited salve to the End of Moore's Law",
    "did": "21-10-22"
  }
]